000_РОЗНИЦА_ЦЕНТР/src/Catalogs/КафкаКаналыОтправки/КафкаКаналыОтправки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КафкаКаналыОтправки</name>
  <attributes>
    <name>ТипОтправки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КаналОтправки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСодержимого</name>
    <type>
      <types>EnumRef.КафкаТипСодержимого</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилаОбмена</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяТипаОтправки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоШаблону</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапросаДляШаблона</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПромежуточнаяЗапись</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/КафкаКаналыОтправки/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИмяТипаОтправкиЗаполнить();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипОтправкиПриИзменении(Элемент)

	Объект.ИмяТипаОтправки = "";
	ИмяТипаОтправкиЗаполнить();

КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ЗагрузитьПравило(Команда)
//	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗагрузитьПравилоЗавершение", ЭтотОбъект);
//	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов("Выберите файлы картинок", Истина, "*.xml");
//	
//	ОповещениеОХодеВыполнения = Новый ОписаниеОповещения("ЗагрузитьПравилоХодВыполнения", ЭтотОбъект);
//	НачатьПомещениеФайловНаСервер(ОповещениеОЗавершении, ОповещениеОХодеВыполнения, , ПараметрыДиалога,
//		УникальныйИдентификатор);
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьПравилоЗавершение(ПомещенныеФайлы, Дополнительно) Экспорт
	Если ПомещенныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ПомещенныйФайл Из ПомещенныеФайлы Цикл
		АдресФайла = ПомещенныйФайл.Адрес;
		Объект.ПравилаОбмена = ПрочитатьПравило(АдресФайла);
		Модифицированность = Истина;
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПрочитатьПравило(АдресФайла)
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайла);
	СтрокаXML = Неопределено;
	
	Попытка
        ЧтениеДанных = Новый ЧтениеДанных(ДвоичныеДанные);
        ЧтениеДанных.КодировкаТекста = КодировкаТекста.UTF8;
        ЧтениеТекста = Новый ЧтениеТекста(ЧтениеДанных.ИсходныйПоток(), КодировкаТекста.UTF8);
        СтрокаXML = ЧтениеТекста.Прочитать();
        ЧтениеТекста.Закрыть();
        ЧтениеДанных.Закрыть();
    Исключение
        Сообщить("Не удалось получить строку XML из файла.");
	КонецПопытки;
	
	Возврат СтрокаXML;
КонецФункции

&НаКлиенте
Процедура ЗагрузитьПравилоХодВыполнения(ПомещаемыйФайлы, Помещено, ОтказОтПомещенияФайла, ПомещеноВсего, ОтказОтПомещенияФайлов, Дополнительно) Экспорт
	Состояние("Помещение файлов картинок товаров", ПомещеноВсего);
КонецПроцедуры

&НаСервере
Процедура ИмяТипаОтправкиЗаполнить()
		
	Элементы.ИмяТипаОтправки.СписокВыбора.Очистить();
	
	Если Объект.ТипОтправки = "Справочник" Тогда
		
		Для Каждого СтрокаМетаданных Из Метаданные.Справочники Цикл
			
			ИмяТипа = СтрокаМетаданных.Имя;
			
			Элементы.ИмяТипаОтправки.СписокВыбора.Добавить(ИмяТипа, ИмяТипа);
			
		КонецЦикла;

	ИначеЕсли Объект.ТипОтправки = "Документ" Тогда
		
		Для Каждого СтрокаМетаданных Из Метаданные.Документы Цикл
			
			ИмяТипа = СтрокаМетаданных.Имя;
			
			Элементы.ИмяТипаОтправки.СписокВыбора.Добавить(ИмяТипа, ИмяТипа);
			
		КонецЦикла;

	ИначеЕсли Объект.ТипОтправки = "РегистрСведений" Тогда
		
		Для Каждого СтрокаМетаданных Из Метаданные.РегистрыСведений Цикл
			
			ИмяТипа = СтрокаМетаданных.Имя;
			
			Элементы.ИмяТипаОтправки.СписокВыбора.Добавить(ИмяТипа, ИмяТипа);
			
		КонецЦикла;

	КонецЕсли;


КонецПроцедуры
